sakura-internet/smc_sco-ltem1wlm_nrf9160/src/main.c
/*
 * Copyright (c) 2023 SAKURA internet Inc.
 *
 * SPDX-License-Identifier: MIT
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <sys/types.h>
#include <nrf_modem.h>
#include <nrf_modem_at.h>

#include <zephyr/kernel.h>
#include <zephyr/init.h>
#include <zephyr/device.h>
#include <zephyr/pm/device.h>
#include <zephyr/net/socket.h>

#include <zephyr/drivers/uart.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/adc.h>
#include <zephyr/drivers/watchdog.h>
#include <modem/lte_lc.h>

#define UDP_IP_HEADER_SIZE 28
#define UART_TIMEOUT_MSEC 1000

static const struct device *uart_dev = DEVICE_DT_GET(DT_NODELABEL(uart0)); //UART

static const struct gpio_dt_spec ST_A_LED = GPIO_DT_SPEC_GET(DT_ALIAS(led0), gpios);
static const struct gpio_dt_spec ST_B_LED = GPIO_DT_SPEC_GET(DT_ALIAS(led1), gpios);
static const struct gpio_dt_spec WA_START = GPIO_DT_SPEC_GET(DT_ALIAS(led2), gpios);
static const struct gpio_dt_spec WS_POWER = GPIO_DT_SPEC_GET(DT_ALIAS(led3), gpios);
static const struct gpio_dt_spec ADV_EN   = GPIO_DT_SPEC_GET(DT_ALIAS(led4), gpios);
static const struct gpio_dt_spec SW0      = GPIO_DT_SPEC_GET(DT_ALIAS(sw0), gpios);
static const struct gpio_dt_spec SW1      = GPIO_DT_SPEC_GET(DT_ALIAS(sw1), gpios);
static const struct gpio_dt_spec SW2      = GPIO_DT_SPEC_GET(DT_ALIAS(sw2), gpios);
static const struct gpio_dt_spec SW3      = GPIO_DT_SPEC_GET(DT_ALIAS(sw3), gpios);

static const struct device *adc_dev = DEVICE_DT_GET(DT_NODELABEL(adc)); //ADC
static const struct adc_channel_cfg battsence_channel_cfg = 
                     ADC_CHANNEL_CFG_DT(DT_CHILD(DT_NODELABEL(adc), channel_0)); //ADC

static const struct device *i2c_dev = DEVICE_DT_GET(DT_NODELABEL(i2c2)); //I2C

static int wdt_main_channel;
static const struct device *const wdt_dev = DEVICE_DT_GET(DT_NODELABEL(wdt)); //WDT

static int client_fd;
static struct sockaddr_storage host_addr;
static struct k_work_delayable server_transmission_work;

static K_SEM_DEFINE(lte_connected, 0, 1);
static K_SEM_DEFINE(cereg_sem, 0, 1);

//GPIO初期化
static int gpio_init(void)
{
    int ret;

	if (!device_is_ready(SW0.port) ||
	    !device_is_ready(SW1.port) ||
	    !device_is_ready(SW2.port) ||
	    !device_is_ready(SW3.port) ||
	    !device_is_ready(ST_A_LED.port) ||
	    !device_is_ready(ST_B_LED.port) ||
	    !device_is_ready(WA_START.port) ||
	    !device_is_ready(WS_POWER.port) ||
	    !device_is_ready(ADV_EN.port)) {
		printk("\n **** GPIO initialize error ****\n");
	}

	//入力ピン
	ret = gpio_pin_configure_dt(&SW0, GPIO_INPUT | GPIO_PULL_UP);
	if (ret) {
		printk("\n **** Configure SW0 pin failed (%d) ****",ret);
	}
	ret = gpio_pin_configure_dt(&SW1, GPIO_INPUT | GPIO_PULL_UP);
	if (ret) {
		printk("\n **** Configure SW1 pin failed (%d) ****",ret);
	}
	ret = gpio_pin_configure_dt(&SW2, GPIO_INPUT | GPIO_PULL_UP);
	if (ret) {
		printk("\n **** Configure SW2 pin failed (%d) ****",ret);
	}
	ret = gpio_pin_configure_dt(&SW3, GPIO_INPUT | GPIO_PULL_UP);
	if (ret) {
		printk("\n **** Configure SW3 pin failed (%d) ****",ret);
	}

	//出力ピン
	ret = gpio_pin_configure_dt(&ST_A_LED, GPIO_OUTPUT_ACTIVE);
	if (ret) {
		printk("\n **** Configure ST_A_LED pin failed (%d) ****",ret);
	}
	ret = gpio_pin_configure_dt(&ST_B_LED, GPIO_OUTPUT_INACTIVE);
	if (ret) {
		printk("\n **** Configure ST_B_LED pin failed (%d) ****",ret);
	}
	ret = gpio_pin_configure_dt(&WA_START, GPIO_OUTPUT_INACTIVE);
	if (ret) {
		printk("\n **** Configure WA_START pin failed (%d) ****",ret);
	}
	ret = gpio_pin_configure_dt(&WS_POWER, GPIO_OUTPUT_INACTIVE);
	if (ret) {
		printk("\n **** Configure WS_POWER pin failed (%d) ****",ret);
	}
	ret = gpio_pin_configure_dt(&ADV_EN, GPIO_OUTPUT_INACTIVE);
	if (ret) {
		printk("\n **** Configure ADV_EN pin failed (%d) ****",ret);
	}

    ret = gpio_pin_set_dt(&ST_A_LED, 0); //ST_A_LED
	if (ret) {
		printk("\n **** Set LED 0 pin failed (%d) ****",ret);
	}
    ret = gpio_pin_set_dt(&ST_B_LED, 0); //ST_B_LED
	if (ret) {
		printk("\n **** Set LED 1 pin failed (%d) ****",ret);
	}
    ret = gpio_pin_set_dt(&WA_START, 0);//WA_START
	if (ret) {
		printk("\n **** Set LED 2 pin failed (%d) ****",ret);
	}
    ret = gpio_pin_set_dt(&WS_POWER, 0);//WS_POWER
	if (ret) {
		printk("\n **** Set LED 3 pin failed (%d) ****",ret);
	}
    ret = gpio_pin_set_dt(&ADV_EN, 0); //ADV_EN
	if (ret) {
		printk("\n **** Set LED 4 pin failed (%d) ****",ret);
	}

    return 0;
}

//I2Cのライト関数(デバイスドライバ, データ, 長さ, スレーブアドレス)
static int write_bytes(const struct device *i2c_dev, uint8_t *data, uint32_t num_bytes, uint8_t slave_addr)
{
	struct i2c_msg msgs;

	//ライトデータセット
	msgs.buf = data;
	msgs.len = num_bytes;
	msgs.flags = I2C_MSG_WRITE | I2C_MSG_STOP;

	//I2Cライト実行
	return i2c_transfer(i2c_dev, &msgs, 1, slave_addr);
}

//I2Cの読み込み関数(デバイスドライバ, 先頭アドレス(8bit), データ, 長さ, スレーブアドレス)
static int read_bytes(const struct device *i2c_dev, uint8_t addr, uint8_t *data, uint32_t num_bytes, uint8_t slave_addr)
{
	uint8_t wr_addr[2];
	struct i2c_msg msgs[2];

	//リードアドレスセット
	wr_addr[0] = addr;
	wr_addr[1] = addr;
	msgs[0].buf = wr_addr;
	msgs[0].len = 1U;
	msgs[0].flags = I2C_MSG_WRITE | I2C_MSG_RESTART;

	//リードデータセット
	msgs[1].buf = data;
	msgs[1].len = num_bytes;
	msgs[1].flags = I2C_MSG_READ | I2C_MSG_STOP;

	//I2Cリード実行
	return i2c_transfer(i2c_dev, &msgs[0], 2, slave_addr);
}

//I2C初期化
int i2c_init(void) {

	if (!i2c_dev) {
	  printk("device_get_binding i2c failed\n");
	  return -1;
	}
	
	return 0;
}

//温度計測
float measure_temp() {
	uint8_t I2C_BUFF[3]; //I2Cデータバッファ
	int err;

	I2C_BUFF[0] = 0x01; //ポインタレジスタ(コンフィグレーションレジスタセット)
	I2C_BUFF[1] = 0x81; //コンフィグレーションレジスタ(ワンショット有効＆シャットダウンモード有効)
	err = write_bytes(i2c_dev, I2C_BUFF, 2, 0x48); //I2C書き込み2バイト
	if (err != 0) {
		return 99;
	}

	//温度変換完了待ち
	err = read_bytes(i2c_dev, 0x01, I2C_BUFF, 1, 0x48);
	if (err != 0) {
		return 99;
	}

	while (I2C_BUFF[0] != 0x01)
	{
		err = read_bytes(i2c_dev, 0x01, I2C_BUFF, 1, 0x48);
	}
	if (err != 0) {
		return 99;
	}

