sakura-internet/smc_sco-ltem1wlm_nrf9160/src/main.c
	//温度計測値読み出し
	err = read_bytes(i2c_dev, 0x00, I2C_BUFF, 2, 0x48);
	if (err != 0) {
		return 99;
	}

	//ビット演算
	uint16_t uv = ((uint16_t)I2C_BUFF[0] << 8) | I2C_BUFF[1]; //計測値を16bit幅に結合
	int16_t v = (int16_t)uv; //符号ありの変数に変換
	v >>= 4; //符号ありの状態で計測値を正しい桁にシフト
	return (float)v/16.0; //1bit解像度0.0625℃のため16で割って小数点ありで戻す
}

//ADC初期化
int adc_init(void) {
	int err;
	if (!adc_dev) {
		printk("device_get_binding adc failed\n");
		return -1;
	}
	err = adc_channel_setup(adc_dev, &battsence_channel_cfg);
	if (err) {
		printk("Error in adc setup: %d\n", err);
	return -1;
	}
	return 0;
}

//バッテリー電圧計測
int16_t measure_batt_mv() {
	int err;
	int16_t a_sample_buffer[10] = {0};
	int16_t s_sample_buffer = 0;
	int a;

	pm_device_action_run(adc_dev, PM_DEVICE_ACTION_RESUME);

	int16_t m_sample_buffer;
	const struct adc_sequence sequence = {
		.channels = BIT(7),
		.buffer = &m_sample_buffer,
		.buffer_size = sizeof(m_sample_buffer),
		.resolution = 12,
		.oversampling = 8,
		.calibrate = 1,
	};

	if (!adc_dev) {
		return -1;
	}

	gpio_pin_set_dt(&ADV_EN, 1); //ADV_enable
	for (a = 0; a < 10; a++) {
		//k_msleep(1);
		err = adc_read(adc_dev, &sequence);
		a_sample_buffer[a] = m_sample_buffer;
	}
	gpio_pin_set_dt(&ADV_EN, 0); //ADV desable
	if (err) {
		printk("ADC read err: %d\n", err);
	return -1;
	}

	for (a = 0; a < 10; a++) {
		//printk("a_sample_buffer[%d]: %d\n", a, a_sample_buffer[a]);
		s_sample_buffer = s_sample_buffer + a_sample_buffer[a];
	}
	s_sample_buffer = s_sample_buffer / 10;
	//printk("s_sample_buffer: %d\n", s_sample_buffer);

	double adc_value = (double)s_sample_buffer;
	adc_value = adc_value * 3600.0d; // MAX3.6V
	adc_value = adc_value / 4095.0d; // 12bit
	adc_value = adc_value * 1.529411765; // 抵抗分圧

	pm_device_action_run(adc_dev, PM_DEVICE_ACTION_SUSPEND);

	return (int16_t)adc_value;
}

//UART有効無効切り替え(消費電力削減)
static void uart0_set_enable(bool enable)
{
	const struct device *uart_dev = DEVICE_DT_GET(DT_NODELABEL(uart0));

	if (!device_is_ready(uart_dev)) {
		return;
	}

	pm_device_action_run(uart_dev, enable ? PM_DEVICE_ACTION_RESUME : PM_DEVICE_ACTION_SUSPEND);
}

//ウォッチドッグタイマーカウンタ(初期化対象外変数の定義)
volatile uint8_t WDT_call_count __attribute__((section(".noinit.test_wdt")));

//ウォッチドッグタイマーコールバック
static void wdt_cb(const struct device *wdt_dev, int channel_id)
{
	ARG_UNUSED(wdt_dev);
	ARG_UNUSED(channel_id);
	WDT_call_count++; //WDT鳴いたら+1
}

//ウォッチドッグタイマー初期化
static int wdt_init(void)
{
	int err;

	//送信間隔 +30秒で設定
	static struct wdt_timeout_cfg wdt_cfg = {
	    .window.max = (CONFIG_UDP_DATA_UPLOAD_FREQUENCY_SECONDS + 30) * 1000,
	    .callback = wdt_cb,
	    .flags = WDT_FLAG_RESET_SOC,
	};

	if (!device_is_ready(wdt_dev)) {
		printk("\n*** WDT device is not ready\n");
		return -1;
	}

	wdt_main_channel = wdt_install_timeout(wdt_dev, &wdt_cfg);
	if (wdt_main_channel < 0) {
		printk("\n*** Could not install wdt timeout. (error: %d)\n", wdt_main_channel);
		return wdt_main_channel;
	}

	err = wdt_setup(wdt_dev, WDT_OPT_PAUSE_HALTED_BY_DBG);
	if (err < 0) {
		printk("\n*** Could not setup WDT\n");
		return err;
	}
	printk("\nWatchdog set up with a %d sec interval\n", wdt_cfg.window.max / 1000);

	return 0;
}

//UDPサーバ初期化
static int server_init(void)
{
	struct sockaddr_in *server4 = ((struct sockaddr_in *)&host_addr);
	printk("server_init start\n");
	server4->sin_family = AF_INET;
	server4->sin_port = htons(CONFIG_UDP_SERVER_PORT);

	inet_pton(AF_INET, CONFIG_UDP_SERVER_ADDRESS_STATIC, &server4->sin_addr);

	return 0;
}

//UDP切断
static void server_disconnect(void)
{
	printk("UDP server disconnect\n");
	(void)close(client_fd);
}

//UDP接続
static int server_connect(void)
{
	int err;

	printk("server connect start\n");
	client_fd = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP); //ソケット
	if (client_fd < 0) {
		printk("Failed to create UDP socket: %d\n", errno);
		err = -errno;
		server_disconnect();
		return err;
	}

	err = connect(client_fd, (struct sockaddr *)&host_addr, sizeof(struct sockaddr_in)); //指定IPに接続
	if (err < 0) {
		printk("Connect failed : %d\n", errno);
		server_disconnect();
		return err;
	}

	return 0;
}

//UDPデータ送信ファンクション
uint32_t countUDPsend = 1;
static void server_transmission_work_fn(struct k_work *work)
{
	int err;
	char ResponseBuffer[128] = {0};
	char buffer[256] = {"\0"};
	char request_iccid[32] = {0};
	char request_cclk[21] = {0};
	char request_cops[15] = {0};
	int countTimeout = 0;
	char rx_byte;
	char data_wls[13][20] = {{0},{0}};
	int countRetry = 0;
	int a,i = 0;
	char ResponseData[17][12];
	char *ResponsePt;

	char request_plmn[8] = {0};
	char request_tac[7] = {0};
	char request_band[3] = {0};
	char request_cell_id[11] = {0};
	char request_es[2] = {0};
	char request_rsrp[4] = {0};
	char request_rsrq[4] = {0};
	char request_snr[4] = {0};
	char setMB7388 = 0;
	char setMB7051 = 0;
	char setSensor10Meter = 0;

	uart0_set_enable(true); //UART有効

	printk("\n\n************************************************\n");
	printk("Start of measurement and transmission. No.%d\n", countUDPsend);

	printk("DIP-SW status [%d:%d:%d:%d]\n",gpio_pin_get_dt(&SW0),gpio_pin_get_dt(&SW1),gpio_pin_get_dt(&SW2),gpio_pin_get_dt(&SW3));

	//DIPスイッチ 2番 センサータイプ
	// ON：ショートタイプMB7388(10m)
	//OFF：ショートタイプMB7389(5m)
	if(gpio_pin_get_dt(&SW2) == 1) {
		setMB7388 = 1; //MB7388(10m)
	} else {
		setMB7388 = 0; //MB7389(5m)
	}

	//DIPスイッチ 3番 センサータイプ
	// ON：ロングタイプMB7051(10m)
	//OFF：ショートタイプMB7389(5m)
	if(gpio_pin_get_dt(&SW3) == 1) {
		setMB7051 = 1; //MB7051(10m)
	} else {
		setMB7051 = 0; //MB7389(5m)
	}

	//センサー距離情報セット
	if(gpio_pin_get_dt(&SW2) == 0 && gpio_pin_get_dt(&SW3) == 0) {
		setSensor10Meter = 0; //5mセンサー
	} else {
		setSensor10Meter = 1; //10mセンサー
	}

	//超音波センサーデータ情報取得処理
	gpio_pin_set_dt(&WS_POWER, 1); //センサー電源ON
	gpio_pin_set_dt(&WA_START, 1); //センサー計測スタート
	k_msleep(170); //起動メッセージ流れ待ち
	do {
		printk("Ultrasonic Range Finder Sensing Try.%d\n", countRetry + 1);
		//配列初期化
		for(a = 0; a < 13; a++) {
			for (i = 0; i < 20; i++) {
				data_wls[a][i] = 0;
			}
		}
		//UART受信処理
		for(a = 0; a < 13; a++) {
			i = 0;
			rx_byte = 0;
			countTimeout = 0;
			//最終受信文字が改行コードだった場合は次の配列(行)に移る
			while (rx_byte != 13) {
				err = uart_poll_in(uart_dev, &rx_byte); //UART受信データ1文字読み込み。空だった場合は待ち。
				if (err != -1) {
					countTimeout = 0;
					if (rx_byte != 'R' && rx_byte != 13) {
						data_wls[a][i] = rx_byte; //UART受信データが'R'もしくは改行コードでなければ1文字格納
						i++;
					}
				} else {
					countTimeout++;     //UARTのデータが空だった場合はカウントアップ
					k_msleep(1); //1msスリープ
				}
				//タイムアウト判定 1秒以内にUART受信できなかった場合はタイムアウト
				if (countTimeout > UART_TIMEOUT_MSEC) {
					printk("*** Range Finder Timeout\n");
					break;
				}
			}
			//タイムアウト時は配列に-999を書いてブレイク
			if (countTimeout > UART_TIMEOUT_MSEC) {
				for (a = 0; a < 13; a++) {
					sprintf(data_wls[a], "-999");
				}
				break;
			}
		}
		//タイムアウト時はブレイク
		if (countTimeout > UART_TIMEOUT_MSEC) {
			break;
		}
		//デバッグ用
		for (a = 8; a < 13; a++) {
			printk("DATA [%02d] %.4s\n", a, data_wls[a]);
		}
		//センサーがロングタイプMB7051(10m)の場合は値を10倍してcmからmmにする処理
		if (setMB7051 == 1 && atoi(data_wls[0]) != -999) {
			for (a = 8; a < 13; a++) {
				if (atoi(data_wls[a]) > 999) {
					sprintf(data_wls[a],"9999"); //999cm(9990mm以上のときはエラー値に置き換え
				} else {
					sprintf(data_wls[a],"%d", atoi(data_wls[a]) * 10);
				}
				//printk("MB7051 String %s\n", data_wls[a]);
			}
		}
		//計測値エラー判定
		//エラーの場合は-1をセットする
		//配列の8,9,10,11,12を計測値として採用
		//5mセンサーのレンジ 300～4999mm (反射消失の場合は5000mm)
		//10mセンサーのレンジ 500～9998mm (反射消失の場合は9999mm)
		if (atoi(data_wls[0]) != -999) {
			for (a = 8; a < 13; a++) {
				//5mセンサー
				if (setSensor10Meter == 0 && (atoi(data_wls[a]) < 300 || atoi(data_wls[a]) > 4999)) {
					printk("Sensing ERROR [%d] = %s\n", a-7, data_wls[a]);
					sprintf(data_wls[a], "-1"); //5mセンサーで300mm未満と4999mm以上はエラー(検出失敗時は5000mm)
				}
				//10mセンサー
				if (setSensor10Meter == 1 && (atoi(data_wls[a]) < 500 || atoi(data_wls[a]) > 9998)) {
					printk("Sensing ERROR [%d] = %s\n", a-7, data_wls[a]);
					sprintf(data_wls[a], "-1"); //10mセンサーで500mm未満と9998mm以上はエラー(検出失敗時は9999mm)
				}
			}
		}
		//計測値エラー数カウント
		err = 0;
		for (a = 8; a < 13; a++) {
			//printk("Sensing Data No[%d] = %s\n", a-7, data_wls[a]);
			if (atoi(data_wls[a]) < 0) {
				err++;
			}
		}
		//エラー判定表示
		printk("Sensing error count %d\n", err);
		if (err >= 3) {
			printk("Sensing ERROR\n");
		} else {
			printk("Sensing OK\n");
		}
		countRetry++; //リトライカウンター +1
		//リトライ10回目で終了する
		if (countRetry >= 10) {
			countRetry = 11;
			break;
		}
	} while (err >= 3); //3個以上のエラーでリトライ。最低3個の計測値を得る。

	//超音波センサー電源OFF
	gpio_pin_set_dt(&WA_START, 0); //センサー計測停止
	gpio_pin_set_dt(&WS_POWER, 0); //センサー電源OFF

	//XMONITOR情報取得
	//文字列例 [AT%XMONITOR=5,"KDDI","KDDI","44051","185C",7,18,"008AAA5C",316,5900,44,22,"1010","00000000","00100111","01011111"]
	nrf_modem_at_scanf("AT%XMONITOR","%%XMONITOR: %120[ ,-\"a-zA-Z0-9]", ResponseBuffer);
	printk("AT%%XMONITOR=%s\n",ResponseBuffer);
	ResponsePt = strtok(ResponseBuffer,",");
	sprintf(ResponseData[0], "%s", ResponsePt);
	a = 1;
	while (ResponsePt != NULL)
	{
		ResponsePt = strtok(NULL,",");
		if(ResponsePt == NULL) {break;}
		sprintf(ResponseData[a], "%s", ResponsePt);
		a++;
		if(a >= 17) {break;}
	}
	//XMONITOR情報取得成功判定
	if (strcmp(ResponseData[0],"0") == 5) {
		sprintf(request_plmn   , "%.7s" , ResponseData[3]); // PLMN 例["44020"]
		sprintf(request_tac    , "%.6s" , ResponseData[4]); // TACコード 例["185C"]
		sprintf(request_band   , "%.2s" , ResponseData[6]); // バンド番号 例[18]
		sprintf(request_cell_id, "%.10s", ResponseData[7]); // CELL ID 例["008AAA5C"]
	} else {
		printk("AT%%XMONITOR ERROR\n");            // ステータス取得失敗
		sprintf(request_plmn   ,   "\"00000\"" );  // PLMN エラー値
		sprintf(request_tac    ,    "\"0000\"" );  // TACコード エラー値
		sprintf(request_band   ,           "0" );  // バンド番号 エラー値
		sprintf(request_cell_id, "\"00000000\"");  // CELL ID エラー値
	}
	printk("plmn   : %s\n", request_plmn   );
	printk("tac    : %s\n", request_tac    );
	printk("band   : %s\n", request_band   );
	printk("cell_id: %s\n", request_cell_id);

