sakura-internet/smc_sco-ltem1wlm_nrf9160/src/main.c
	//CONEVAL情報取得
	//文字列例 [AT%CONEVAL=0,0,6,42,3,17,"008AAA5C","44051",331,5900,18,0,0,4,2,8,117]
	nrf_modem_at_scanf("AT%CONEVAL","%%CONEVAL: %120[ ,-\"a-zA-Z0-9]", ResponseBuffer);
	printk("AT%%CONEVAL=%s\n",ResponseBuffer);
	ResponsePt = strtok(ResponseBuffer,",");
	sprintf(ResponseData[0], "%s", ResponsePt);
	a = 1;
	while (ResponsePt != NULL)
	{
		ResponsePt = strtok(NULL,",");
		if(ResponsePt == NULL) {break;}
		sprintf(ResponseData[a], "%s", ResponsePt);
		a++;
		if(a >= 17) {break;}
	}
	//CONEVAL情報取得成功判定
	if (strcmp(ResponseData[0],"0") == 0) {
		sprintf(request_es  , "%.1s", ResponseData[2]); // 電力効率 6
		sprintf(request_rsrp, "%.3s", ResponseData[3]); // 信号受信電力 -17
		sprintf(request_rsrq, "%.3s", ResponseData[4]); // 信号受信品質 -30
		sprintf(request_snr , "%.3s", ResponseData[5]); // 信号ノイズ比 49
	} else {
		printk("AT%%CONEVAL ERROR\n");// ステータス取得失敗
		sprintf(request_es  , "0");   // 電力効率 エラー値
		sprintf(request_rsrp, "255"); // 信号受信電力 エラー値
		sprintf(request_rsrq, "255"); // 信号受信品質 エラー値
		sprintf(request_snr , "127"); // 信号ノイズ比 エラー値
	}
	printk("es   : %s\n", request_es  );
	printk("rsrp : %s\n", request_rsrp);
	printk("rsrq : %s\n", request_rsrq);
	printk("snr  : %s\n", request_snr );

	//時刻情報取得 文字列例 [+CCLK: "18/12/06,22:10:00+08"]
	err = nrf_modem_at_scanf("AT+CCLK?","+CCLK: \"%20[,:+/0-9]\"", request_cclk);
	printk("AT+CCLK=%s\n",request_cclk);
	if (err != 1){
		sprintf(request_cclk, "-1,-1");
	}

	//ICCID取得
	err = nrf_modem_at_scanf("AT%XICCID","%%XICCID: ""%20[0-9]", request_iccid);
	printk("AT%%XICCID=%s\n",request_iccid);
	if (err != 1) {
		sprintf(request_iccid, "-1");
	}

	int16_t value_battmv = measure_batt_mv(); //電源電圧取得
	float value_temp = measure_temp();        //温度取得

	//送信文字列生成
	sprintf(buffer, "%.20s,%.19s,%04d,%+06.2f,%.4s,%.4s,%.4s,%.4s,%.4s,%010d,%.2s,%.7s,%.6s,%.10s,%.1s,%.3s,%.3s,%.3s,%1d,%02d",
	                request_cclk,     //時刻 (20文字制限)
	                request_iccid,    //ICCID (19文字制限)
	                value_battmv,     //電源電圧
	                value_temp,       //温度
	                data_wls[ 8],     //超音波距離測定1回目 (4文字制限)
	                data_wls[ 9],     //超音波距離測定2回目 (4文字制限)
	                data_wls[10],     //超音波距離測定3回目 (4文字制限)
	                data_wls[11],     //超音波距離測定4回目 (4文字制限)
	                data_wls[12],     //超音波距離測定5回目 (4文字制限)
	                countUDPsend,     //送信回数
	                request_band   ,  //バンド番号 (2文字制限)
	                request_plmn   ,  //PLMN番号 (7文字制限)
	                request_tac    ,  //TACコード (6文字制限)
	                request_cell_id,  //セルID (10文字制限)
	                request_es     ,  //エネルギー効率 (1文字制限)
	                request_rsrp   ,  //RSRP 受信電力 (3文字制限)
	                request_rsrq   ,  //RSRQ 受信可能電力 (3文字制限)
	                request_snr    ,  //SNR  信号ノイズ比 (3文字制限)
	                setSensor10Meter, //超音波センサー種別(0:5m/1:10m)
	                countRetry - 1    //距離測定リトライ回数
	                );
	printk("UDP send data [%s]\n", buffer);
	printk("Transmitting UDP/IP payload of %d bytes to the ", strlen(buffer) + UDP_IP_HEADER_SIZE);
	printk("IP address %s, port number %d\n", CONFIG_UDP_SERVER_ADDRESS_STATIC, CONFIG_UDP_SERVER_PORT);
	printk("WDT call count %d\n", WDT_call_count);
	err = send(client_fd, buffer, strlen(buffer), 0); //UDP送信実行

	//UDP送信のデッドロックバグ回避
	if (err < 0) {
		printk("Failed to transmit UDP packet, %d\n", errno);

		//再送信を行う。それでもエラーが出た場合はシステムリセットする
		printk("Resend UDP packet\n");
		server_disconnect();    //サーバ切断
		err = server_connect(); //サーバ接続
		if (err) {
			printk("Not able to connect to UDP server\n"); //UDPサーバ接続エラー
		} else {
			printk("UDP server connected\n"); //UDPサーバ接続成功
		}
		err = send(client_fd, buffer, strlen(buffer), 0); //UDP送信実行
		if (err < 0) {
			printk("Failed to transmit UDP packet, %d\n", errno); //UDP送信エラー
			NVIC_SystemReset(); //システムリセット
		} else {
			printk("Resend Success UDP packet, %d\n", errno); //UDP再送信成功
		}
	} else {
		printk("Success to transmit UDP packet, %d\n", errno);
	}

	//COPS情報取得 文字列例[+COPS: 0,2,"44020",7]
	//基地局への接続が確認できなかった場合はシステムリセットする
	nrf_modem_at_scanf("AT+COPS?","+COPS: %14[,\"0-9]", request_cops);
	printk("AT+COPS=%s\n",request_cops);
	if (strcmp(request_cops,"1") == 0 )
	{
		printk("CONNECTION ERROR\n");
		NVIC_SystemReset(); //システムリセット
	}

	//送信完了でWDTリセット
	wdt_feed(wdt_dev, wdt_main_channel); //WDTリセット
	WDT_call_count = 0;

	countUDPsend++; //連続送信回数カウント
	printk("************************************************\n\n");
	uart0_set_enable(false); //UART停止
	k_work_schedule(&server_transmission_work, K_SECONDS(CONFIG_UDP_DATA_UPLOAD_FREQUENCY_SECONDS)); //次のUDP送信をスケジュールに追加
}

//定期送信スレッド初期化
static void work_init(void)
{
	k_work_init_delayable(&server_transmission_work, server_transmission_work_fn);
	printk("work_init done.\n");
}

//LTEハンドラ
static void lte_handler(const struct lte_lc_evt *const evt)
{
	switch (evt->type) {
	case LTE_LC_EVT_NW_REG_STATUS:
		if ((evt->nw_reg_status != LTE_LC_NW_REG_REGISTERED_HOME) &&
		     (evt->nw_reg_status != LTE_LC_NW_REG_REGISTERED_ROAMING)) {
			break;
		}

		printk("Network registration status: %s\n",evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_HOME ? "Connected - home network" : "Connected - roaming\n");
		k_sem_give(&lte_connected);
		break;
	case LTE_LC_EVT_PSM_UPDATE:
		printk("PSM parameter update: TAU: %d, Active time: %d\n",evt->psm_cfg.tau, evt->psm_cfg.active_time);
		break;
	case LTE_LC_EVT_EDRX_UPDATE: {
		char log_buf[60];
		ssize_t len;

		len = snprintf(log_buf, sizeof(log_buf),
			       "eDRX parameter update: eDRX: %f, PTW: %f\n",
			       evt->edrx_cfg.edrx, evt->edrx_cfg.ptw);
		if (len > 0) {
			printk("%s\n", log_buf);
		}
		break;
	}
	case LTE_LC_EVT_RRC_UPDATE:
		printk("RRC mode: %s\n",evt->rrc_mode == LTE_LC_RRC_MODE_CONNECTED ? "Connected" : "Idle\n");
		break;
	case LTE_LC_EVT_CELL_UPDATE:
		printk("LTE cell changed: Cell ID: %d, Tracking area: %d\n",evt->cell.id, evt->cell.tac);
		break;
	default:
		break;
	}
}

//LTE link controller 初期化
static void modem_init(void)
{
	int err;

	//Initializes the module and configures the modem. 
	err = lte_lc_init();
	if (err) {
		printk("Modem initialization failed, error: %d\n", err);
		return;
	}

	//Power Saving Mode Enable
	err = lte_lc_psm_req(true);
	if (err) {
		printk("lte_lc_psm_req, error: %d\n", err);
	}

	//Enhanced Discontinuous Reception Enable
	/* eDRX使用時にコメントアウト解除
	err = lte_lc_edrx_req(true);
	if (err) {
		printk("lte_lc_edrx_req, error: %d\n", err);
	}

