sakura-internet/smc_sco-ltem1wlm_nrf9160/src/main.c
	//Release Assistance Indication Enable
	err = lte_lc_rai_req(true);
	if (err) {
		printk("lte_lc_rai_req, error: %d\n", err);
	}
	*/

}

volatile uint8_t first_boot __attribute__((section(".noinit.boot")));   //初回起動フラグ(初期化対象外変数の定義)
volatile uint8_t startup_PLMN __attribute__((section(".noinit.plmn"))); //LTE接続先変数(初期化対象外変数の定義)

//LTE接続手続きATコマンド群
static int modem_connect(void)
{
    int err = 0;
    char setPLMN[32] = {0};

	//ATコマンド確認
	printk("AT\n");
	err = nrf_modem_at_printf("AT");
	printk("responce %d\n", err);
	if (err) {
		printk(" *** AT failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//APN設定
	printk("\nAPN setting\n");
	printk("AT+CGDCONT=1,%s,%s\n","\"IP\"","\"sakura\"");
	err = nrf_modem_at_printf("AT+CGDCONT=1,%s,%s\n","\"IP\"","\"sakura\"");
	if (err) {
		printk(" *** AT+CGDCONT failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//LTE cat.M1 固定
	printk("\nLTE-M setting\n");
	printk("AT%%XSYSTEMMODE=1,0,0,1\n");
	err = nrf_modem_at_printf("AT%%XSYSTEMMODE=1,0,0,1");
	if (err) {
		printk(" *** AT%%XSYSTEMMODE failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//ネットワーク切断
	printk("\nDis connecting to network\n");
	printk("AT+CFUN=0\n");
	err = nrf_modem_at_printf("AT+CFUN=0");
	if (err) {
		printk(" *** AT+CFUN failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//接続先キャリア設定 PLMNセット
	//初回起動時はDIPスイッチに従う (first_boot != 0xAA)
	//2回目以降は前回の接続キャリアの次のキャリアをセットする
	//ソフトバンク→ドコモ→KDDIの順に試行する
	printk("\nPLMN setting\n");
	if (first_boot != 0xAA) {
		first_boot = 0xAA;
		//初回起動 (DIPスイッチでセット)
		if(gpio_pin_get_dt(&SW0) == 0 && gpio_pin_get_dt(&SW1) == 0) {
			startup_PLMN = 0; //ソフトバンク
		}
		else if (gpio_pin_get_dt(&SW0) == 1 && gpio_pin_get_dt(&SW1) == 0) {
			startup_PLMN = 1; //ドコモ
		}
		else if (gpio_pin_get_dt(&SW0) == 0 && gpio_pin_get_dt(&SW1) == 1) {
			startup_PLMN = 2; //KDDI
		}
		else {
			startup_PLMN = 0; //ソフトバンク
		}
	} else {
		//2回目以降 (再接続試行5回目で次のPLMNに移る)
		if (WDT_call_count >= 5) {
			WDT_call_count = 0;
			if (startup_PLMN >= 2) {
				startup_PLMN = 0;
			} else {
				startup_PLMN++;
			}
		}
	}
	//PLMNの設定
	switch (startup_PLMN) {
		case 0: sprintf(setPLMN, "AT+COPS=1,2,%s\n","\"44020\""); printk("carrier select SoftBank\n");break;
		case 1: sprintf(setPLMN, "AT+COPS=1,2,%s\n","\"44010\""); printk("carrier select docomo\n");break;
		case 2: sprintf(setPLMN, "AT+COPS=1,2,%s\n","\"44051\""); printk("carrier select KDDI\n");break;
		default:sprintf(setPLMN, "AT+COPS=1,2,%s\n","\"44020\""); printk("carrier select SoftBank\n");break;
	}

	printk("%s", setPLMN);
	err = nrf_modem_at_printf("%s", setPLMN);
	if (err) {
		printk(" *** AT+COPS failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//UICCサスペンド設定 SIMのサスペンドどリジュームを有効化
	printk("\nUICC suspend and deactivate control\n");
	printk("AT+SSRDA=1,1,0\n");
	err = nrf_modem_at_printf("AT+SSRDA=1,1,0");
	if (err) {
		printk(" *** AT+SSRDA failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//LTE接続開始
	printk("\nConnecting to network\n");
	printk("AT+CFUN=1\n");
	err = nrf_modem_at_printf("AT+CFUN=1");
	if (err) {
		printk(" *** AT+CFUN failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//CPUパワーレベル設定　最小電力にセット
	printk("\nModem power level setting (Ultra-low power)\n");
	printk("AT%%XDATAPRFL=0\n");
	err = nrf_modem_at_printf("AT%%XDATAPRFL=0");
	if (err) {
		printk(" *** AT%%XDATAPRFL failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//PSM設定
	//Enable power saving mode
	//Requested_Periodic-TAU-ext 1hour x 6 = 6hour
	//Requested_Active-Time 2sec x 0 = 0sec
	printk("\nPower saving mode setting\n");
	printk("AT+CPSMS=1,\"\",\"\",\"00100110\",\"00000000\"\n");
	err = nrf_modem_at_printf("AT+CPSMS=1,\"\",\"\",\"00100110\",\"00000000\"");
	if (err) {
		printk(" *** AT+CPSMS failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//PTW設定
	printk("\nPaging Time Window (PTW) setting\n");
	printk("AT%%XPTW=4,\"1111\"\n");
	err = nrf_modem_at_printf("AT%%XPTW=4,\"1111\"");
	if (err) {
		printk(" *** AT%%XPTW failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	//eDRX設定
	printk("\neDRX setting\n");
	printk("AT+CEDRXS=2,4,\"1010\"\n");
	err = nrf_modem_at_printf("AT+CEDRXS=2,4,\"1010\"");
	if (err) {
		printk(" *** AT+CEDRXS failed\n");
		printk("AT command error, type: %d\n\n", nrf_modem_at_err_type(err));
	}

	err = lte_lc_connect_async(lte_handler);
	printk("\nlte_lc_connect_async status %d\n",err);
	if (err) {
		printk("Connecting to LTE network failed, error: %d\n",err);
	}

    return err;
}

//**** main ****//
void main(void)
{
	int err;
	int countSleepMin = 0;
	int wdtSleepMin = 0;

	if (!device_is_ready(uart_dev)) {
		printk("\n**** UART device not ready ****\n");
	}

	printk("\n\n------ LTE Water Level Gauge v1.1.0 ------\n");
	printk(    "--- Development is SAKURA internet Inc.---\n");

	wdt_init(); //WDT初期化

	//ウォッチドッグが鳴いた回数で接続試行にウェイトをかける
	printk("First boot %d\n", first_boot);
	printk("WDT count %d\n", WDT_call_count);
	if (first_boot != 0xAA) {
		WDT_call_count = 0; //初回起動時リセット
	}
	if (WDT_call_count >= 6) {
		WDT_call_count = 0; //6以上がセットされたらリセット
	}
	switch(WDT_call_count){
		case 0: wdtSleepMin = 0; printk("none sleep\n");break; //初回接続
		case 1: wdtSleepMin = 1; printk("sleep %dmin\n",wdtSleepMin); break; //1分 (再接続1回目)
		case 2: wdtSleepMin = 2; printk("sleep %dmin\n",wdtSleepMin); break; //2分 (再接続2回目)
		case 3: wdtSleepMin = 4; printk("sleep %dmin\n",wdtSleepMin); break; //4分 (再接続3回目)
		case 4: wdtSleepMin = 8; printk("sleep %dmin\n",wdtSleepMin); break; //8分 (再接続4回目)
		default:wdtSleepMin = 0; break; //PLMNを変更 (再接続5回目)
	}
	for (countSleepMin = wdtSleepMin; countSleepMin > 0; countSleepMin--) {
		if (countSleepMin > 10) {
			break; //10分を超える値がセットされていた場合はループを抜ける
		}
		wdt_feed(wdt_dev, wdt_main_channel);//WDTリセット
		uart0_set_enable(true); //UART有効
		printk("%d minute sleep remaining\n", countSleepMin);
		uart0_set_enable(false); //UART停止
		k_sleep(K_SECONDS(60)); //1分スリープ
	}
	uart0_set_enable(true); //UART有効

	gpio_init();     //GPIO初期化
	adc_init();      //ADC初期化
	i2c_init();      //I2C初期化
	work_init();     //UDP送信スレッド初期化
	modem_init();    //LTEモデム初期化
	modem_connect(); //LTE接続用ATコマンド発行

	err = k_sem_take(&lte_connected, K_SECONDS(35)); //指定時間接続完了待ち
	if (err == -EAGAIN) 
	{
		printk("\n*** CONNECTION TIMEOUT!!\n");
		WDT_call_count++; //WDTカウンタを加算
		NVIC_SystemReset(); //接続タイムアウトでシステムリセット
	}

	wdt_feed(wdt_dev, wdt_main_channel);//WDTリセット
	WDT_call_count = 0;

	err = server_init(); //UDPサーバ初期化
	printk("server_init status %d\n",err);
	if (err) {
		printk("Not able to initialize UDP server connection\n");
	}

	err = server_connect(); //UDPコネクト
	printk("server_connect status %d\n",err);
	if (err) {
		printk("Not able to connect to UDP server\n");
	}

	//UDP定期送信スレッド実行
	k_work_schedule(&server_transmission_work, K_NO_WAIT);
}
